# Data Processing

Objective:

- Clean location, salary, titles 
- Make sure data size is large enough
- Clean JD 
    - Remove stop words
    - basic tokenization
    - get most frequently used words
    - create bigrams, or ngrams, or bag or words
    - count vectorization

In [1]:
import time
import nltk
from nltk.corpus import stopwords

from nltk import word_tokenize, FreqDist
from nltk.corpus import stopwords
from nltk.collocations import *
import string, re

from gensim.models import Word2Vec

from sklearn.manifold import TSNE
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.model_selection import train_test_split

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
np.random.seed(0)

### Concat all jobs together

In [96]:
import time, glob

#Iterate through list of filenames and read each in
outfilename = 'all_' + str((int(time.time()))) + ".csv"

filenames = glob.glob('*.csv')

import shutil

with open(outfilename, 'wb') as outfile:
    for filename in glob.glob('*.csv'):
        if filename == outfilename:
            # don't want to copy the output into the output
            continue
        with open(filename, 'rb') as readfile:
            shutil.copyfileobj(readfile, outfile)

In [55]:
outfile

In [2]:
df = pd.read_csv('all_1589665998.csv', encoding='latin-1')

In [3]:
df.head()

,Unnamed: 0,Title,Company,Location,Link,Review,Salary,Description
0,0.0,Data Scientist,Lockheed Martin,"Arlington, VA",https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...,4,None,Description:Are you ready to take your career ...
1,1.0,Support Scientist Ocean Data Assimilation (HAFS),IMSG/NOAA,"Arlington, VA",https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...,None,None,"Overview I.M. Systems Group, Inc. (IMSG) is se..."
2,2.0,"2021048 Data Scientist $215,000.00",B4CORP,"Arlington, VA",https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...,None,"Up to $215,000 a year",Position Requires a Top Secret (TS/SCI) Cleara...
3,3.0,Senior Data Engineer - Data Quality and Monito...,Freddie Mac,"Arlington, VA",https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...,3.8,None,Are you passionate to work with the most valua...
4,4.0,Chief Scientist Machine Learning,Leidos,"Arlington, VA",https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...,3.7,None,Description\rJob Description:\rThe Leidos Arti...

In [4]:
df = df.drop('Unnamed: 0', axis=1)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12155 entries, 0 to 12154
Data columns (total 7 columns):
Title          12155 non-null object
Company        12151 non-null object
Location       12155 non-null object
Link           12155 non-null object
Review         12155 non-null object
Salary         12155 non-null object
Description    12155 non-null object
dtypes: object(7)
memory usage: 664.9+ KB

#### Remove Duplicates

In [6]:
df2 = df.drop_duplicates(subset='Link', keep = 'first', inplace = False)

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7066 entries, 0 to 12034
Data columns (total 7 columns):
Title          7066 non-null object
Company        7064 non-null object
Location       7066 non-null object
Link           7066 non-null object
Review         7066 non-null object
Salary         7066 non-null object
Description    7066 non-null object
dtypes: object(7)
memory usage: 441.6+ KB

In [8]:
df2.groupby('Location').count().sort_values(by='Salary', ascending=True);

In [9]:
def rename_location(x):
    if "New York" in x:
        y = "New York, NY"
    else: 
        y = x
    return y

In [10]:
df2['Location2'] = df2['Location'].apply(rename_location)

/Applications/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [11]:
df2.to_csv("job_data_1.csv")

In [12]:
df2 = pd.read_csv("job_data_1.csv")

In [13]:
df2.Salary.unique()

array(['None', 'Up to $215,000 a year', '$60,000 a year',
       '$20 - $25 an hour', '$70,000 - $85,000 a year',
       '$45 - $55 an hour', '$102,663 - $157,709 a year',
       '$40 - $60 an hour', '$21.93 - $26.43 an hour',
       '$40,000 - $60,000 a year', '$82,326 - $105,339 a year',
       '$45 an hour', '$1,200 - $4,200 a month',
       '$100,000 - $150,000 a year', '$140,000 - $175,000 a year',
       '$67,968 - $126,062 a year', '$75 - $100 an hour',
       '$121,316 - $157,709 a year', '$72,030 - $137,012 a year',
       'Up to $125,000 a year', '$1,000 a month', '$130,000 a year',
       '$27.17 - $36.60 an hour', '$120,000 - $170,000 a year',
       'Up to $100,000 a year', '$120,000 - $150,000 a year',
       '$40,000 - $50,000 a year', '$190,000 a year', '$20 - $27 an hour',
       '$50 - $55 an hour', '$100,000 - $145,000 a year',
       '$160,000 - $175,000 a year', '$70,000 - $80,000 a year',
       '$85,000 - $165,000 a year', '$145,000 - $165,000 a year',
       '$125,000 - $155,000 a year', '$100,000 - $200,000 a year',
       '$80,000 - $130,000 a year', '$73,052 - $148,967 a year',
       '$100,000 - $165,000 a year', '$67,093 - $122,310 a year',
       '$40 - $45 an hour', '$16.83 - $21.62 an hour',
       '$10 - $15 an hour', '$60 an hour', '$30,000 - $200,000 a year',
       '$62,000 - $72,000 a year', '$70 - $75 an hour', nan,
       '$88,744 - $162,767 a year', '$28 - $35 an hour',
       '$71,548 - $205,939 a year', '$50,000 a year', '$27 - $31 an hour',
       '$30 - $40 an hour', '$25 - $35 an hour',
       '$60,000 - $85,000 a year', '$36,268 - $51,812 a year',
       '$60,000 - $70,000 a year', '$85,000 a year',
       '$25.00 - $32.50 an hour', '$65,000 - $75,000 a year',
       '$175,000 a year', '$85,000 - $95,000 a year', '$50 - $60 an hour',
       '$50,000 - $65,000 a year', '$70,000 a year',
       '$51,004 - $62,338 a year', '$4,000 - $7,000 a month',
       '$90,000 - $135,000 a year', '$35 - $40 an hour',
       '$50,000 - $75,000 a year', '$22 - $39 an hour', '$45,000 a year',
       '$63,000 a year', '$48,950 - $64,000 a year',
       '$100,000 - $110,000 a year', '$57,000 - $65,000 a year',
       '$93,964 a year', '$80,000 - $90,000 a year', '$17 an hour',
       '$66,088 - $85,915 a year', '$100,000 - $125,000 a year',
       '$53,917 - $120,874 a year', '$50,000 - $70,000 a year',
       '$250,000 - $450,000 a year', '$250,000 - $400,000 a year',
       '$88,000 - $118,000 a year', '$5,500 - $7,000 a month',
       '$25 - $30 an hour', '$32.50 - $35.00 an hour', '$4,749 a month',
       '$30,000 - $35,000 a year', '$80,000 - $84,000 a year',
       '$70,000 - $76,000 a year', '$90 an hour',
       '$50,000 - $60,000 a year', '$20 - $22 an hour',
       '$4,917 - $7,400 a month', '$80,000 - $120,000 a year',
       '$5,259 - $6,941 a month', '$65,000 - $85,000 a year',
       '$75,000 - $85,000 a year', '$21 - $25 an hour',
       '$4,917 - $6,489 a month', 'From $12 an hour', '$35 - $37 an hour',
       '$40 - $50 an hour', '$4,917 - $8,060 a month',
       '$45,000 - $65,000 a year', '$65 - $75 an hour',
       '$73,675 - $101,317 a year', '$29 - $34 an hour',
       '$120,000 - $180,000 a year', '$40,000 - $45,000 a year',
       '$14 an hour', '$69,000 a year', '$89,700 - $148,800 a year',
       '$80,700 - $131,500 a year', '$53,000 - $55,000 a year',
       '$69,929 - $102,939 a year', '$115,000 - $160,000 a year',
       '$90,000 - $110,000 a year', '$140,000 - $170,000 a year',
       '$58,909 - $76,583 a year', '$60 - $65 an hour',
       '$35 - $45 an hour', '$58,391 - $83,592 a year',
       '$137,200 - $240,100 a year', '$110,000 - $113,000 a year',
       '$71,102 - $104,970 a year', '$63,916 - $84,253 a year',
       '$23 - $26 an hour', '$85,000 - $120,000 a year',
       '$90 - $115 an hour', '$41,600 - $51,900 a year',
       '$45,000 - $50,000 a year', '$52 an hour',
       '$75,000 - $106,062 a year', '$15 an hour',
       '$144,600 - $218,700 a year', '$35,000 - $45,000 a year',
       '$104 - $105 an hour', '$70,000 - $90,000 a year',
       '$95,400 - $121,800 a year', '$90,000 a year',
       '$95,100 - $135,000 a year', '$80,000 - $160,000 a year',
       '$90,000 - $130,000 a year', '$119,900 - $176,700 a year',
       '$153,300 - $201,600 a year', '$150,000 a year', '$140,000 a year',
       '$300,000 a year', '$120,000 - $175,000 a year', '$180,000 a year',
       '$90,000 - $120,000 a year', '$166,200 - $218,700 a year',
       '$53 - $60 an hour', '$145,000 a year', '$185,000 a year',
       '$110,000 - $130,000 a year', '$70,000 - $75,000 a year',
       '$29 - $30 an hour', '$33,960 - $57,493 a year',
       '$65,000 - $70,000 a year', '$38,000 - $42,000 a year',
       '$100,000 a year', '$34 - $35 an hour', '$40,300 - $87,457 a year',
       '$9 - $13 an hour', '$16 - $23 an hour', '$7.25 an hour',
       '$40 - $48 an hour', '$14 - $18 an hour', '$18 - $19 an hour',
       '$38,000 - $46,000 a year', '$19 - $25 an hour',
       '$65,000 - $80,000 a year', '$49.18 an hour',
       '$60,000 - $80,000 a year', '$36,683 - $57,370 a year',
       '$60,000 - $89,000 a year', '$98,000 - $125,000 a year',
       '$42,935 a year', '$19.07 an hour', '$51 - $58 a day',
       '$30 - $36 an hour', '$46,107 - $98,841 a year',
       '$30 - $50 an hour', '$65,000 - $90,000 a year', '$105,000 a year',
       '$46 - $50 an hour', '$16 - $20 an hour', '$15 - $18 an hour',
       '$80,000 - $85,000 a year', '$60,000 - $110,000 a year',
       '$35 - $55 an hour', '$25.04 - $31.02 an hour',
       '$30 - $35 an hour', '$10 an hour', '$80,000 - $110,000 a year',
       '$55,000 - $60,000 a year', '$22,607 a year',
       '$90,000 - $100,000 a year', '$22 - $30 an hour',
       '$36 - $38 an hour', '$120,000 - $160,000 a year',
       '$70,000 - $140,000 a year', '$36 - $43 an hour',
       '$85,000 - $200,000 a year', '$25 - $45 an hour',
       '$40,000 - $130,000 a year', '$75,000 - $100,000 a year',
       '$30 - $32 an hour', 'From $16 an hour',
       '$80,000 - $105,000 a year', '$44,000 - $55,000 a year',
       '$74,321 - $139,159 a year', '$100,000 - $160,000 a year',
       '$50 - $65 an hour', '$18.92 - $28.38 an hour',
       '$50,000 - $95,000 a year', '$76,000 - $110,000 a year',
       '$60 - $75 an hour', '$75,200 a year', '$55,000 - $65,000 a year',
       '$45 - $60 an hour', '$100,000 - $135,000 a year',
       '$36.30 - $55.37 an hour', '$55 - $75 an hour', '$55 an hour',
       '$70,000 - $95,000 a year', '$72,200 a year',
       '$120,000 - $130,000 a year', '$75,100 a year', '$95,000 a year',
       'From $69,415 a year', '$80,000 a year',
       '$60,000 - $75,000 a year', '$11 - $12 an hour',
       '$13 - $18 an hour', '$75 - $125 an hour', '$70 an hour',
       '$55 - $60 an hour', '$99,357 - $226,108 a year',
       '$110,000 - $150,000 a year', '$120,000 - $240,000 a year',
       '$4,583 - $5,833 a month', '$7,224 - $8,623 a month',
       '$65,000 a year', '$85,000 - $110,000 a year', '$50 an hour',
       '$150,000 - $200,000 a year', '$110,000 a year', '$3,450 a month',
       '$19 - $20 an hour', '$120,000 - $140,000 a year',
       '$35,000 - $40,000 a year', '$15 - $20 an hour',
       '$65,000 - $110,000 a year', '$25 - $72 an hour',
       '$6,765 - $8,861 a month', '$140,000 - $180,000 a year',
       '$80,000 - $95,000 a year', '$45 - $50 an hour',
       '$100,000 - $120,000 a year', '$65 an hour', '$98 - $100 an hour',
       '$60 - $80 an hour', '$20 an hour', '$79,047 - $101,662 a year',
       '$25 - $27 an hour', '$27.40 an hour', '$62,865 - $80,827 a year',
       '$65,428 - $84,671 a year', '$43,251 - $76,808 a year',
       '$165,000 a year', '$35 - $38 an hour', '$47,305 - $60,315 a year',
       '$17 - $20 an hour', '$51,038 - $61,445 a year',
       '$69,267 - $89,058 a year', '$135,000 a year',
       '$28,000 - $35,000 a year', '$93,442 - $127,413 a year',
       '$30 an hour', '$28.31 - $36.80 an hour', '$80 an hour',
       '$30 - $33 an hour', 'From $100,000 a year', '$50 - $85 an hour',
       '$25 - $29 an hour', '$101,066 - $137,814 a year',
       '$105,113 - $143,324 a year', '$14.75 - $25.00 an hour',
       '$18 - $22 an hour', '$97,183 - $132,508 a year',
       '$36,772 - $65,000 a year', '$20 - $30 an hour',
       '$24 - $36 an hour', '$12 an hour', '$33,000 - $40,000 a year',
       '$16 an hour', '$40,000 a year', 'Salary', '$42,000 a year',
       'Up to $120,000 a year', 'From $13 an hour',
       '$89,000 - $111,000 a year', '$77,000 - $97,000 a year',
       '$83,500 - $95,000 a year', '$85,000 - $130,000 a year',
       '$60,000 - $65,000 a year', '$40,000 - $65,000 a year',
       '$24,000 - $30,000 a year', '$15 - $25 an hour',
       '$225,000 - $500,000 a year', '$68,000 - $70,000 a year',
       '$20 - $36 an hour', '$14 - $20 an hour', 'Up to $55,000 a year',
       '$25 an hour', 'Up to $20 an hour', '$75,000 - $90,000 a year',
       '$2,000 - $4,000 a month', '$48,000 a year', '$75,000 a year',
       '$90,000 - $140,000 a year', '$125,000 - $135,000 a year',
       '$49,390 - $113,900 a year', '$29 - $32 an hour',
       '$69,000 - $100,000 a year', '$60,000 - $90,000 a year',
       '$19 - $24 an hour', '$54,080 a year', '$25.91 an hour',
       'Up to $5,000 a month', '$35,000 - $60,000 a year',
       '$35,000 a year', '$2,500 - $5,000 a month',
       '$45,000 - $60,000 a year', '$35,000 - $50,000 a year',
       '$81,000 - $101,000 a year', '$95,000 - $115,000 a year',
       '$60,000 - $120,000 a year', '$150,000 - $170,000 a year',
       '$55,000 - $66,000 a year', '$16 - $19 an hour',
       '$1,500 - $3,000 a month', '$125,000 - $150,000 a year',
       '$112,950 - $149,900 a year', '$14 - $15 an hour',
       '$45,000 - $55,000 a year', '$28 - $30 an hour', '$51.25 an hour',
       '$55,287 - $105,988 a year', '$40 - $46 an hour',
       '$15 - $17 an hour', '$81,299 - $101,623 a year',
       '$48,000 - $50,000 a year', '$70 - $80 an hour',
       '$55 - $65 an hour', '$58 an hour', '$155,000 - $160,000 a year',
       '$59,509 - $85,000 a year', '$73,243 - $95,000 a year',
       '$27 - $35 an hour', '$20 - $21 an hour',
       '$59,000 - $70,000 a year', '$45 - $65 an hour',
       '$55,473 - $68,898 a year', '$75,504 - $94,761 a year',
       '$50,507 - $130,000 a year', '$59,816 - $128,299 a year',
       '$54,100 - $64,419 a year', '$72,576 a year',
       '$98,099 - $120,937 a year', 'Up to $126,086 a year',
       '$50,000 - $55,000 a year', 'Up to $109,647 a year',
       '$17 - $19 an hour', '$55 - $69 an hour',
       '$110,000 - $180,000 a year', '$30.00 - $30.01 an hour',
       '$60 - $63 an hour', '$140,000 - $160,000 a year',
       '$125,000 - $175,000 a year', 'From $150,000 a year',
       'Up to $150,000 a year', '$85,000 - $115,000 a year',
       '$41 - $51 an hour', '$48 - $50 an hour',
       '$180,000 - $210,000 a year', '$60,000 - $100,000 a year',
       'Up to $10,000 a year', '$53,956 - $66,388 a year',
       '$125,000 - $130,000 a year', '$109 an hour', '$120,000 a year',
       'From $30 an hour', '$103 an hour', '$12.25 an hour',
       '$165,000 - $220,000 a year', '$103,281 - $126,232 a year',
       '$34.25 an hour', 'From $200,000 a year',
       '$91,000 - $116,000 a year', '$40 an hour', '$110,000 a year ++',
       '$90,000 - $95,000 a year', 'Up to $80,000 a year',
       '$25 - $34 an hour', '$80,000 - $100,000 a year',
       '$20,000 - $100,000 a year', '$40 - $80 an hour',
       '$75 - $85 an hour', '$95,000 - $105,000 a year', '$26 an hour',
       '$70,000 - $100,000 a year', '$21.85 - $25.30 an hour',
       '$40,000 - $100,000 a year', '$97,360 - $126,571 a year',
       '$130,000 - $150,000 a year', '$4,312 - $6,294 a month',
       '$65 - $70 an hour', '$11.25 an hour', '$16 - $18 an hour',
       '$64,866 - $68,889 a year', '$18 - $20 an hour',
       '$40,000 - $55,000 a year', '$105,650 - $146,300 a year',
       '$160,000 a year', '$14.25 an hour', '$115,050 - $149,562 a year',
       '$53,738 - $65,017 a year', '$71,870 - $110,944 a year',
       '$125,000 - $145,000 a year', '$129,761 - $168,693 a year',
       '$56,459 - $68,309 a year', '$34 - $40 an hour',
       '$40 - $55 an hour', '$46,156 - $59,999 a year', '$115,000 a year',
       '$60 - $120 an hour', '$90,000 - $115,000 a year',
       '$150,000 - $250,000 a year', '$150,000 - $225,000 a year',
       '$200,000 a year', '$130,000 - $175,000 a year', '$195,000 a year',
       '$160,000 - $200,000 a year', '$45.60 an hour',
       '$70 - $90 an hour', '$200,000 - $350,000 a year',
       '$220,000 a year', '$175,000 - $200,000 a year',
       '$80,000 - $150,000 a year', '$40,000 - $70,000 a year',
       '$160,000 - $225,000 a year', '$250,000 a year',
       '$50,000 - $120,000 a year', '$61,930 - $162,227 a year',
       '$85 - $90 an hour', '$125,000 - $240,000 a year',
       '$23,000 a year', '$68,000 - $73,000 a year',
       '$50,932 - $105,236 a year', '$37 - $45 an hour',
       '$91,589 - $129,700 a year', '$100 - $110 an hour',
       '$85,000 - $98,900 a year', '$75 an hour', '$77 - $87 an hour',
       '$91,231 - $144,676 a year', '$104,286 - $131,196 a year',
       '$50 - $75 an hour', '$43.31 - $54.48 an hour',
       '$84,000 - $90,000 a year', '$60 - $70 an hour',
       '$50.14 - $63.08 an hour', '$8,613 - $10,766 a month',
       '$81.56 an hour', '$90,090 - $113,308 a year',
       '$6,389 - $9,583 a month', '$48.19 - $60.63 an hour',
       '$120,744 - $151,892 a year', '$102,770 - $154,150 a year',
       '$50 - $66 an hour', '$28 - $38 an hour',
       '$81,800 - $89,000 a year', '$50 - $70 an hour', '$4,217 a month',
       '$50,400 - $55,200 a year', '$112,000 - $168,000 a year',
       '$6,591 a month', '$11,000 - $15,000 a month',
       '$45,000 - $70,000 a year', '$60 - $67 an hour',
       '$42.59 - $51.76 an hour', '$16.35 an hour',
       '$200,000 - $250,000 a year', '$50 - $80 an hour',
       '$150,000 - $240,000 a year', 'From $13.50 an hour',
       '$17 - $25 an hour', '$33.65 an hour',
       '$130,000 - $140,000 a year', '$126,100 - $160,000 a year',
       '$170,000 - $250,000 a year', '$130,000 - $180,000 a year',
       '$150,000 - $180,000 a year', '$82,000 - $102,000 a year',
       '$100,000 - $105,000 a year', '$64,535 - $83,897 a year',
       '$58,429 - $75,958 a year', '$120,000 - $138,000 a year',
       '$200,000 - $225,000 a year', '$19 - $23 an hour',
       '$36,000 - $65,000 a year', '$15.75 an hour',
       '$120,000 - $145,000 a year', '$115,000 - $140,000 a year',
       '$55 - $58 an hour', '$111,098 - $140,823 a year',
       '$17.00 - $19.50 an hour', '$50,000 - $62,000 a year',
       '$48,500 - $59,000 a year', '$140,000 - $200,000 a year',
       '$130,000 - $145,000 a year', '$44,000 - $48,000 a year',
       '$41.15 - $52.16 an hour', '$44,000 - $56,000 a year',
       '$85,629 - $128,433 a year', 'Up to $60 an hour',
       '$99,736 - $120,744 a year', '$78,426 - $82,347 a year',
       '$100 - $105 an hour', '$100,000 - $130,000 a year',
       '$30 - $60 an hour', '$35 an hour', '$40 - $70 an hour',
       '$120,000 - $200,000 a year', '$109,000 - $119,000 a year',
       '$89,000 - $99,000 a year', '$108,000 - $118,000 a year'],
      dtype=object)

#### Subset dataframe with Salary info

In [14]:
salary_df = df2[df2['Salary']!= 'None'].drop(['Location','Unnamed: 0'], axis = 1)

In [15]:
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1162 entries, 2 to 7261
Data columns (total 7 columns):
Title          981 non-null object
Company        964 non-null object
Link           964 non-null object
Review         964 non-null object
Salary         964 non-null object
Description    964 non-null object
Location2      959 non-null object
dtypes: object(7)
memory usage: 72.6+ KB

We have 964 jobs with salary info. Let's look at their titles.

In [16]:
salary_list = salary_df['Salary'].unique().tolist()

##### Adjust Hourly and Daily Salary to Yearly

In [17]:
def salary_base(x):
    y=""
    if "year" in str(x):
        y = "Yearly"
    if "hour" in str(x):
        y = "Hourly"
    if "day" in str(x):
        y = "Daily"
    elif "month" in str(x):
        y = "Monthly"
    
    return y

In [18]:
salary_df['Rate_by'] = salary_df['Salary'].apply(salary_base)

In [19]:
salary_df = salary_df[salary_df['Rate_by']!=""]

In [20]:
indexNames = salary_df[salary_df['Rate_by']==""].index
 
# Delete these row indexes from dataFrame
salary_df.drop(indexNames , inplace=True)

In [21]:
salary_df.reset_index(drop=True);

In [22]:
salary_df.groupby('Rate_by').Salary.count()

Rate_by
Daily        1
Hourly     294
Monthly     31
Yearly     637
Name: Salary, dtype: int64

#### Split the cell and use regular expression to identify only numbers.

In [23]:
a = "From $69,415 a year" 


pattern = '\$[0-9]*[.,]?[0-9]*'
p = re.compile(pattern)
digits = p.findall(a)
digits

['$69,415']

In [24]:
salary_list;

In [25]:
salary_df[['low','high']] = salary_df.Salary.str.split('-', expand=True)

In [26]:
salary_df[['Rate_by','low','high']]

     Rate_by                    low              high
2     Yearly  Up to $215,000 a year              None
6     Yearly         $60,000 a year              None
8     Hourly                   $20        $25 an hour
11    Yearly               $70,000     $85,000 a year
16    Hourly                   $45        $55 an hour
...      ...                    ...               ...
7192  Yearly              $108,000    $118,000 a year
7199  Yearly               $89,000     $99,000 a year
7208  Yearly               $89,000     $99,000 a year
7212  Yearly               $80,000     $90,000 a year
7261  Yearly               $70,000     $90,000 a year

[963 rows x 3 columns]

In [27]:
def find_salary(a):
    if a:
        pattern = '\$[0-9]*[.,]?[0-9]*'
        p = re.compile(pattern)
        digits = p.findall(a)
        new1 = digits[0].replace("$","")
        new2 = new1.replace(",","")
        
        return float(new2)
    else:
        return 0

In [28]:
salary_df['min'] = salary_df['low'].apply(find_salary)

In [29]:
salary_df['max'] = salary_df['high'].apply(find_salary)

In [30]:
salary_df.head();

In [31]:
salary_df.to_csv("salary_df_5.20.csv")

#### Calculate the adjusted salary (turn all daily/hourly wage to yearly), use average

In [32]:
#Calculate average salary
def adjust_salary(a, b):
    adjusted_salary=[]
    for x, y in zip(a,b):
        if y > 0:
            avg_salary = (x+y)/2
        
        else:
            avg_salary = x
            
        adjusted_salary.append(avg_salary)
        
    return adjusted_salary

In [33]:
salary_df['adjusted_salary'] = adjust_salary(salary_df['min'], salary_df['max'])

In [34]:
#turn hourly, daily and monthly wage to yearly 
def adjust_salary2(m,n):
    adjusted_yearly_salary = []
    for x, y in zip(m,n):
        if x == "Yearly":
            yearly_salary = y
        if x == "Monthly":
            yearly_salary = y*12
        if x == "Hourly":
            yearly_salary = y*40*52
        if x == "Daily":
            yearly_salary = y*5*52
            
        adjusted_yearly_salary.append(yearly_salary)
        
    return adjusted_yearly_salary

In [35]:
salary_df['adjusted_yearly_salary'] = adjust_salary2(salary_df['Rate_by'], salary_df['adjusted_salary'])

In [36]:
salary_df.head()

,Title,Company,Link,Review,Salary,Description,Location2,Rate_by,low,high,min,max,adjusted_salary,adjusted_yearly_salary
2,"2021048 Data Scientist $215,000.00",B4CORP,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...,None,"Up to $215,000 a year",Position Requires a Top Secret (TS/SCI) Cleara...,"Arlington, VA",Yearly,"Up to $215,000 a year",None,215000.0,0.0,215000.0,215000.0
6,Data Science/Data Analyst,CRAiC LLC,https://www.indeed.com/company/CRAiC-LLC/jobs/...,None,"$60,000 a year",Cost Readiness Analytics (CRAiC LLC) is lookin...,"Arlington, VA",Yearly,"$60,000 a year",None,60000.0,0.0,60000.0,60000.0
8,Data Science Intern,MilliporeSigma,https://www.indeed.com/company/Serono/jobs/Dat...,3.9,$20 - $25 an hour,Job Title: Data Science Intern\rA career with ...,"Arlington, VA",Hourly,$20,$25 an hour,20.0,25.0,22.5,46800.0
11,Jr. Data Scientist,Numero Data LLC,https://www.indeed.com/company/Numero-Data-LLC...,None,"$70,000 - $85,000 a year",Ideal candidate should have a degree in a quan...,"Arlington, VA",Yearly,"$70,000","$85,000 a year",70000.0,85000.0,77500.0,77500.0
16,Business Data Quality Engineer,HRU Technical Resources,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...,None,$45 - $55 an hour,Please note that this is not a corp to corp or...,"Arlington, VA",Hourly,$45,$55 an hour,45.0,55.0,50.0,104000.0

#### Join with Cost of Living Index

In [37]:
COI = pd.read_excel("CostofLiving2020.xlsx")

In [38]:
COI.head()

,Rank,City,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
0,1,"New York, NY",100.00,100.00,100.00,100.00,100.00,100.00
1,2,"San Francisco, CA",91.51,115.58,103.02,86.91,94.45,135.90
2,3,"Anchorage, AK",91.36,38.94,66.29,88.42,78.89,118.44
3,4,"Honolulu, HI",89.70,63.03,76.94,89.83,83.60,88.29
4,5,"Brooklyn, NY",88.82,80.49,84.84,83.22,92.77,92.95

In [ ]:
salary_df2 = salary_df.join(COI)

### Helper Functions to deal with text data

* Do we remove stop words or not?
* Do we stem or lemmatize our text data, or leave the words as is?
* Is basic tokenization enough, or do we need to support special edge cases through the use of regex?
* Do we use the entire vocabulary, or just limit the model to a subset of the most frequently used words? If so, how many?
* Do we engineer other features, such as bigrams, or POS tags, or Mutual Information Scores?
* What sort of vectorization should we use in our model? Boolean Vectorization? Count Vectorization? TF-IDF? More advanced vectorization strategies such as Word2Vec?

In [2]:
salary_df = pd.read_csv("salary_final.csv")

In [3]:
salary_df.head()

,Unnamed: 0,Title,Company,Link,Review,Salary,Description,Location2,Rate_by,low,high,min,max,adjusted_salary,adjusted_yearly_salary
0,2,"2021048 Data Scientist $215,000.00",B4CORP,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...,None,"Up to $215,000 a year",Position Requires a Top Secret (TS/SCI) Cleara...,"Arlington, VA",Yearly,"Up to $215,000 a year",NaN,215000.0,0.0,215000.0,215000.0
1,6,Data Science/Data Analyst,CRAiC LLC,https://www.indeed.com/company/CRAiC-LLC/jobs/...,None,"$60,000 a year",Cost Readiness Analytics (CRAiC LLC) is lookin...,"Arlington, VA",Yearly,"$60,000 a year",NaN,60000.0,0.0,60000.0,60000.0
2,8,Data Science Intern,MilliporeSigma,https://www.indeed.com/company/Serono/jobs/Dat...,3.9,$20 - $25 an hour,Job Title: Data Science Intern\rA career with ...,"Arlington, VA",Hourly,$20,$25 an hour,20.0,25.0,22.5,46800.0
3,11,Jr. Data Scientist,Numero Data LLC,https://www.indeed.com/company/Numero-Data-LLC...,None,"$70,000 - $85,000 a year",Ideal candidate should have a degree in a quan...,"Arlington, VA",Yearly,"$70,000","$85,000 a year",70000.0,85000.0,77500.0,77500.0
4,16,Business Data Quality Engineer,HRU Technical Resources,https://www.indeed.com/pagead/clk?mo=r&ad=-6NY...,None,$45 - $55 an hour,Please note that this is not a corp to corp or...,"Arlington, VA",Hourly,$45,$55 an hour,45.0,55.0,50.0,104000.0

In [4]:
def clean_word(job_descriptions):
    jd_data=[]
    pattern = "([a-zA-Z]+(?:'[a-z]+)?)"
    stopwords_list = stopwords.words('english')
    stopwords_list += list(string.punctuation)
    stopwords_list += ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']
    
    for jd in job_descriptions:
        jd_tokens_raw = nltk.regexp_tokenize(jd, pattern)
        jd_tokens=[word.lower() for word in jd_tokens_raw]
        jd_words_stopped = [word for word in jd_tokens if word not in stopwords_list]
        jd_data.append(jd_words_stopped)
    return pd.Series(jd_data) # Turn list of lists to series of lists to use in Word2Vec

In [5]:
#Combine Title with the Description
salary_df['combined_text'] = salary_df['Title'].str.cat(salary_df['Description'], sep = ' ')